In [1]:
import pymysql
import pandas as pd
from sqlalchemy import create_engine
import numpy as np
import getpass

In [2]:
password = getpass.getpass()

········

In [13]:
#1. Establish a connection between Python and the Sakila database
connection_string = 'mysql+pymysql://root:'+password+'@localhost/sakila'

In [14]:
engine = create_engine(connection_string)

In [15]:
query = 'SELECT * FROM actor'  # Your SQL query here
data = pd.read_sql_query(query, engine)

display(data.head())

   actor_id first_name     last_name         last_update
0         1   PENELOPE       GUINESS 2006-02-15 04:34:33
1         2       NICK      WAHLBERG 2006-02-15 04:34:33
2         3         ED         CHASE 2006-02-15 04:34:33
3         4   JENNIFER         DAVIS 2006-02-15 04:34:33
4         5     JOHNNY  LOLLOBRIGIDA 2006-02-15 04:34:33

In [16]:
#2 Write a Python function called rentals_month that retrieves rental data for a given month and year (passed as parameters) from the Sakila database as a Pandas DataFrame.
# The function should take in 3 parameters: engine / month /year

In [17]:
import pandas as pd

def rentals_month(engine, month, year):
    try:
        # Construct SQL query to retrieve rental data for the specified month and year
        query = f"SELECT * FROM rental WHERE MONTH(rental_date) = {month} AND YEAR(rental_date) = {year}"

        # Execute the query using Pandas and the provided engine
        data = pd.read_sql_query(query, engine)

        return data  # Return the retrieved rental data as a Pandas DataFrame

    except Exception as e:
        print(f"An error occurred: {e}")
        return pd.DataFrame()  # Return an empty DataFrame if an error occurs

In [18]:
rental_data = rentals_month(engine, 5, 2005)
display(rental_data.head())

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53

In [19]:
# 3. Develop a Python function called rental_count_month that takes the DataFrame proided by rentals_month as input along with the month and year and returns a new DataFrame containing the number of rentals made by each customer_id during the selected month and year

def rental_count_month(rental_data, month, year):
        # Filter the rental data for the specified month and year
        filtered_data = rental_data[(rental_data['rental_date'].dt.month == month) & 
                                    (rental_data['rental_date'].dt.year == year)]

        # Group by 'customer_id' and calculate rental counts
        rental_counts = filtered_data.groupby('customer_id').size().reset_index(name=f'rentals_{month:02d}_{year}')

        return rental_counts  # Return the DataFrame with rental counts

In [20]:
rental_data = rentals_month(engine, 5, 2005)  # Replace 5 and 2005 with your desired month and year

# Call the rental_count_month function using the rental_data obtained above
result = rental_count_month(rental_data, 5, 2005)

# Display the resulting DataFrame
print(result.head())

   customer_id  rentals_05_2005
0            1                2
1            2                1
2            3                2
3            5                3
4            6                3

In [21]:
# 4. Create a Python function called compare_rentals that takes two DataFrames as input containing the number of rentals made by each customer in different months and years. The function should return a combined DataFrame with a new 'difference' column, which is the difference between the number of rentals in the two months.

def compare_rentals(df1, df2):
        # Merge the two DataFrames on 'customer_id' to combine rental counts
        combined_df = pd.merge(df1, df2, on='customer_id', how='outer')

        # Calculate the difference between rental counts for the two months
        combined_df['difference'] = combined_df.iloc[:, 1] - combined_df.iloc[:, 2]

        return combined_df  # Return the combined DataFrame with the 'difference' column

In [22]:
# Get rental data for May 2005
rental_data_may_2005 = rentals_month(engine, 5, 2005)

# Get rental data for June 2005
rental_data_june_2005 = rentals_month(engine, 6, 2005)

# Calculate rental counts for May 2005 and June 2005
counts_may_2005 = rental_count_month(rental_data_may_2005, 5, 2005)
counts_june_2005 = rental_count_month(rental_data_june_2005, 6, 2005)

# Compare rental counts between May 2005 and June 2005
comparison_result = compare_rentals(counts_may_2005, counts_june_2005)

# Print the resulting DataFrame
display(comparison_result)

     customer_id  rentals_05_2005  rentals_06_2005  difference
0              1              2.0              7.0        -5.0
1              2              1.0              1.0         0.0
2              3              2.0              4.0        -2.0
3              5              3.0              5.0        -2.0
4              6              3.0              4.0        -1.0
..           ...              ...              ...         ...
593          583              NaN              6.0         NaN
594          585              NaN              4.0         NaN
595          591              NaN              3.0         NaN
596          592              NaN              5.0         NaN
597          598              NaN              1.0         NaN

[598 rows x 4 columns]